In [1]:
import pandas as pd
import numpy as np

In [2]:
schools_df = pd.read_csv("C:\\Users\\tt66\\GWDC201805DATA3-Class-Repository-DATA\\Homework\\04-Numpy-Pandas\\Instructions\\PyCitySchools\\raw_data\\schools_complete.csv")

In [3]:
schools_df.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
students_df = pd.read_csv("C:\\Users\\tt66\\GWDC201805DATA3-Class-Repository-DATA\\Homework\\04-Numpy-Pandas\\Instructions\\PyCitySchools\\raw_data\\students_complete.csv")

In [5]:
students_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
renamed_schools_df = schools_df.rename(columns={"name": "school"})   ## key→old name, value→new name
renamed_schools_df.head()

   School ID                 school      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [7]:
combined_schoolsandstudents_df = pd.merge(renamed_schools_df, students_df, how='outer', on='school')
combined_schoolsandstudents_df.head()

,School ID,school,type,size,budget,Student ID,name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [8]:
schools_count = len(combined_schoolsandstudents_df["school"].unique())
students_count = len(combined_schoolsandstudents_df["name"].unique())
district_count = len(combined_schoolsandstudents_df["type"].unique())
total_budget = schools_df["budget"].sum() 
average_reading_score = round(combined_schoolsandstudents_df["reading_score"].mean(),2)
average_math_score = round(combined_schoolsandstudents_df["math_score"].mean(),2)

In [96]:
summary_table = pd.DataFrame({"Total schools": [schools_count],
                              "Total Students": [students_count],
                              "Total Budget": [total_budget],
                              "District Count": [district_count],
                            "Average R Score": [average_reading_score],
                             "Average M Score": [average_math_score]})
                        
                             
summary_table

,Total schools,Total Students,Total Budget,District Count,Average R Score,Average M Score
0,15,32715,24649428,2,81.88,78.99

In [97]:
total_reading_above70 =combined_schoolsandstudents_df[combined_schoolsandstudents_df.reading_score >= 70]
sum_reading_above70 = total_reading_above70["reading_score"].sum() 
sum_reading_above70

2839146

In [87]:
total_reading_score = combined_schoolsandstudents_df[combined_schoolsandstudents_df.reading_score >= 0]
sum_reading_score = total_reading_score["reading_score"].sum() 
sum_reading_score

3207155

In [92]:
print(round(sum_reading_above70/sum_reading_score*100),2)

89.0 2

In [98]:
total_math_above70 =combined_schoolsandstudents_df[combined_schoolsandstudents_df.math_score >= 70]
sum_math_above70 = total_math_above70["math_score"].sum()
total_math_score = combined_schoolsandstudents_df[combined_schoolsandstudents_df.math_score >= 0]
sum_math_score = total_math_score["math_score"].sum() 
print(round(sum_math_above70/sum_math_score*100),2)

80.0 2

In [105]:
average passing = (sum_reading_above70/sum_reading_score*100 + sum_math_above70/sum_math_score*100)/2
average passing

84.35699388012709

In [21]:
#total students of each school
school_groups = students_df.groupby("school")
school_groups["school"].count()

school
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: school, dtype: int64

In [22]:
schools_df.loc[:, ["name", "budget"]].head()

                    name   budget
0      Huang High School  1910635
1   Figueroa High School  1884411
2    Shelton High School  1056600
3  Hernandez High School  3022020
4    Griffin High School   917500

In [23]:
combined_schoolsandstudents_df.loc[:, ["school","name", "math_score"]].head()

              school               name  math_score
0  Huang High School       Paul Bradley          79
1  Huang High School       Victor Smith          61
2  Huang High School    Kevin Rodriguez          60
3  Huang High School  Dr. Richard Scott          58
4  Huang High School         Bonnie Ray          84

In [24]:
combined_schoolsandstudents_df.loc[:, ["school","name", "reading_score"]].head()

              school               name  reading_score
0  Huang High School       Paul Bradley             66
1  Huang High School       Victor Smith             94
2  Huang High School    Kevin Rodriguez             90
3  Huang High School  Dr. Richard Scott             67
4  Huang High School         Bonnie Ray             97

In [115]:
average_score_schools = round(combined_schoolsandstudents_df.groupby("school").mean(),2).loc[:, ["math_score", "reading_score"]]
average_score_schools.head()

                      math_score  reading_score
school
Bailey High School         77.05          81.03
Cabrera High School        83.06          83.98
Figueroa High School       76.71          81.16
Ford High School           77.10          80.75
Griffin High School        83.35          83.82

In [133]:
Top5_math = average_score_schools.nlargest(5, "math_score")
Top5_math

                     math_score  reading_score
school
Pena High School          83.84          84.04
Holden High School        83.80          83.81
Wright High School        83.68          83.96
Thomas High School        83.42          83.85
Shelton High School       83.36          83.73

In [127]:
Top5_reading = average_score_schools.nlargest(5, "reading_score")
Top5_reading

                     math_score  reading_score
school
Pena High School          83.84          84.04
Wilson High School        83.27          83.99
Cabrera High School       83.06          83.98
Wright High School        83.68          83.96
Thomas High School        83.42          83.85